# cap 3

```
g=graph.traversal()

// test
g.V().hasLabel('airport').groupCount().by('country')
g.V().has('code','AUS').out().out().out().has('code','AGR').path().by('code')
g.V().has('code','AUS').repeat(out()).times(3).has('code','AGR').path().by('code')

// 3.2
// Find vertices that are airports
g.V().hasLabel('airport')

// Find the DFW vertex
g.V().has('code','DFW')

// Combining those two previous queries (two ways that are equivalent)
g.V().hasLabel('airport').has('code','DFW')
g.V().has('airport','code','DFW')

g.V().has('airport','code','DFW').next().getClass()
// class org.apache.tinkerpop.gremlin.tinkergraph.structure.TinkerVertex

// What property values are stored in the DFW vertex?
g.V().has('airport','code','DFW').values()

// Return just the city name property
g.V().has('airport','code','DFW').values('city')

// Return the 'runways' and 'icao' property values.
g.V().has('airport','code','DFW').values('runways','icao')

// Find all edges that have a 'dist' property
g.E().has('dist')
// Find all vertices that have a 'region' property
g.V().has('region')
// Find all the vertices that do not have a 'region' property
g.V().hasNot('region')
// The above is shorthand for
g.V().not(has('region'))

// How many airports are there in the graph?
g.V().hasLabel('airport').count()

// How many routes are there?
g.V().hasLabel('airport').outE('route').count()
g.V().outE('route').count()
g.E().hasLabel('route').count()

// How many of each type of vertex are there?
g.V().groupCount().by(label)
g.V().label().groupCount()

// How many of each type of edge are there?
g.E().groupCount().by(label)
g.E().label().groupCount()
g.E().group().by(label).by(count())

// How many airports are there in each country?
g.V().hasLabel('airport').groupCount().by('country')
// How many airports are there in each country? (look at country first)
g.V().hasLabel('country').group().by('code').by(out().count())
// How many airports are there in each continent?
g.V().hasLabel('continent').group().by('code').by(out().count())
// How many airports are there in France (having first counted all countries)
g.V().hasLabel('airport').groupCount().by('country').select('FR')
// How many airports are there in France, Greece and Belgium respectively?
g.V().hasLabel('airport').groupCount().by('country').select('FR','GR','BE')
```